Revit 2027 API
DefinitionBindingMap.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Definition key
)
Public Overridable Function Erase (
	key As Definition
) As Integer
public:
virtual int Erase(
	Definition^ key
)
abstract Erase :
        key : Definition -> int
override Erase :
        key : Definition -> int
Parameters
key Definition
Return Value
Int32
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace